<a href="https://colab.research.google.com/github/krishbhowmick/Pandas_DataFrame/blob/main/Python_Pandas1.3_Data_Manipulation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Python-Pandas-Dataframe**
* For Pandas documentry go to this website-https://pandas.pydata.org/pandas-docs/version/0.25.3/
* geeksforgeeks-python-pandas-dataframe-- https://www.geeksforgeeks.org/python-pandas-dataframe/
* dataquest-pandas-cheat-sheet-- https://www.dataquest.io/blog/pandas-cheat-sheet/

In [ ]:
# Connect the google drive with google Colab

from google.colab import drive
drive.mount('/content/drive/')

Mounted at /content/drive/

# **Data Manipulation**
* **isnull()**	Method creates a Boolean Series for extracting rows with null values
* **notnull()**	Method creates a Boolean Series for extracting rows with non-null values
* **insert()**	Method inserts a column into a DataFrame
* **drop()**	Method is used to delete rows or columns from a DataFrame
* **pop()**	Method is used to delete rows or columns from a DataFrame
* **add()**	Method returns addition of dataframe and other, element-wise (binary operator add)
* **sub()**	Method returns subtraction of dataframe and other, element-wise (binary operator sub)
* **mul()**	Method returns multiplication of dataframe and other, element-wise (binary operator mul)
* **div()**	Method returns floating division of dataframe and other, element-wise (binary operator truediv)

### **Insert**-- Insert column into DataFrame at specified location.
**DataFrame.insert(loc, column, value, allow_duplicates=False)**
* **loc--> int**
Insertion index. Must verify 0 <= loc <= len(columns).
* **column--> str, number, or hashable object**
Label of the inserted column.
* **value--> int, Series, or array-like**
* **allow_duplicates--> bool, optional**

In [ ]:
# How to make a DataFrame using Dictanary
import numpy as np
import pandas as pd
weather_data = {
    'day': ['1/1/2017','1/2/2017','1/3/2017',pd.NaT,'1/5/2017','1/6/2017', pd.NaT],
    'temperature': [32,np.nan,35,28,32,31,34],
    'windspeed': [6,7,2,np.NaN,4,np.NaN,5],
    'event': ['Rain', 'Sunny', 'Snow','Snow',None, 'Sunny', None]
}
df = pd.DataFrame(weather_data)
df

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         35.0        2.0   Snow
3       NaT         28.0        NaN   Snow
4  1/5/2017         32.0        4.0   None
5  1/6/2017         31.0        NaN  Sunny
6       NaT         34.0        5.0   None

In [ ]:
# Using DataFrame.insert() to add a column 
#df.insert(4, "Test", [0,1,21, 23, 24, 21], True)  # True --> It will save, even it's exist in column
df.insert(4, "Test", [0,1,21, 23, 24, 21, 6])
df

        day  temperature  windspeed  event  Test
0  1/1/2017         32.0        6.0   Rain     0
1  1/2/2017          NaN        7.0  Sunny     1
2  1/3/2017         35.0        2.0   Snow    21
3       NaT         28.0        NaN   Snow    23
4  1/5/2017         32.0        4.0   None    24
5  1/6/2017         31.0        NaN  Sunny    21
6       NaT         34.0        5.0   None     6

### **Drop**--Drop specified labels from rows or columns. 
**DataFrame.drop(labels=None, axis=0, index=None, columns=None, level=None, inplace=False, errors='raise')**
* **labels--> single label or list-like**
Index or column labels to drop.
* **axis--> {0 or ‘index’, 1 or ‘columns’}, default 0**
Whether to drop labels from the index (0 or ‘index’) or columns (1 or ‘columns’).
* **index--> single label or list-like**
Alternative to specifying axis (labels, axis=0 is equivalent to index=labels).
* **columns--> single label or list-like**
Alternative to specifying axis (labels, axis=1 is equivalent to columns=labels).
* **level--> int or level name, optional**
For MultiIndex, level from which the labels will be removed.
* **inplace--> bool, default False**
If False, return a copy. Otherwise, do operation inplace and return None.
* **errors--> {‘ignore’, ‘raise’}, default ‘raise’**
If ‘ignore’, suppress error and only existing labels are dropped.

In [ ]:
# Using DataFrame.insert() to Delete/Drop a column 
df.drop('Test', axis=1, inplace=True)              # where 1 is the axis number (0 for rows and 1 for columns)
df

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         35.0        2.0   Snow
3       NaT         28.0        NaN   Snow
4  1/5/2017         32.0        4.0   None
5  1/6/2017         31.0        NaN  Sunny
6       NaT         34.0        5.0   None

### Pop

# **Merge, Concatination, Join/Combine**
Use these commands to combine multiple dataframes into a single one.

* **df1.append(df2) |** Add the rows in df1 to the end of df2 (columns should be identical)
* **pd.concat([df1, df2],axis=1) |** Add the columns in df1 to the end of df2 (rows should be identical)
* **df1.join(df2,on=col1,how='inner') |** SQL-style join the columns in df1 with the columns on df2 where the rows for col have identical values. 'how' can be one of 'left', 'right', 'outer', 'inner'

## **Merge**-- SQL JOIN
**DataFrame.merge(right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=False, suffixes=('_x', '_y'), copy=True, indicator=False, validate=None)**

* **right--> DataFrame or named Series**
Object to merge with.

* **how--> {‘left’, ‘right’, ‘outer’, ‘inner’, ‘cross’}, default ‘inner’**
Type of merge to be performed.
** **left:** use only keys from left frame, similar to a SQL left outer join; preserve key order.
** **right:** use only keys from right frame, similar to a SQL right outer join; preserve key order.
** **outer:** use union of keys from both frames, similar to a SQL full outer join; sort keys lexicographically.
** **inner:** use intersection of keys from both frames, similar to a SQL inner join; preserve the order of the left keys.
** **cross:** creates the cartesian product from both frames, preserves the order of the left keys.

New in version 1.2.0.

* **on--> label or list**
Column or index level names to join on. These must be found in both DataFrames. If on is None and not merging on indexes then this defaults to the intersection of the columns in both DataFrames.
* **left_on--> label or list, or array-like**
Column or index level names to join on in the left DataFrame. Can also be an array or list of arrays of the length of the left DataFrame. These arrays are treated as if they are columns.
* **right_on--> label or list, or array-like**
Column or index level names to join on in the right DataFrame. Can also be an array or list of arrays of the length of the right DataFrame. These arrays are treated as if they are columns.
* **left_index--> bool, default False**
Use the index from the left DataFrame as the join key(s). If it is a MultiIndex, the number of keys in the other DataFrame (either the index or a number of columns) must match the number of levels.
* **right_index--> bool, default False**
Use the index from the right DataFrame as the join key. Same caveats as left_index.
* **sort--> bool, default False**
Sort the join keys lexicographically in the result DataFrame. If False, the order of the join keys depends on the join type (how keyword).
* **suffixes--> list-like, default is (“_x”, “_y”)**
A length-2 sequence where each element is optionally a string indicating the suffix to add to overlapping column names in left and right respectively. Pass a value of None instead of a string to indicate that the column name from left or right should be left as-is, with no suffix. At least one of the values must not be None.
* **copy--> bool, default True**
If False, avoid copy if possible.
* **indicator--> bool or str, default False**
If True, adds a column to the output DataFrame called “_merge” with information on the source of each row. The column can be given a different name by providing a string argument. The column will have a Categorical type with the value of “left_only” for observations whose merge key only appears in the left DataFrame, “right_only” for observations whose merge key only appears in the right DataFrame, and “both” if the observation’s merge key is found in both DataFrames.
* **validate--> str, optional**
If specified, checks if merge is of specified type.
** “one_to_one” or “1:1”: check if merge keys are unique in both left and right datasets.
** “one_to_many” or “1:m”: check if merge keys are unique in left dataset.
** “many_to_one” or “m:1”: check if merge keys are unique in right dataset.
** “many_to_many” or “m:m”: allowed, but does not result in checks.

In [ ]:
#Basic Merge Using a Dataframe Column
import pandas as pd
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
})
df1

       city  temperature
0  new york           21
1   chicago           14
2   orlando           35

In [ ]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","orlando"],
    "humidity": [65,68,75],
})
df2

       city  humidity
0   chicago        65
1  new york        68
2   orlando        75

In [ ]:
df3 = pd.merge(df1, df2, on="city")
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [ ]:
#Type Of DataBase Joins
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando", "baltimore"],
    "temperature": [21,14,35, 38],
})
df1

        city  temperature
0   new york           21
1    chicago           14
2    orlando           35
3  baltimore           38

In [ ]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","san diego"],
    "humidity": [65,68,71],
})
df2

        city  humidity
0    chicago        65
1   new york        68
2  san diego        71

In [ ]:
df3=pd.merge(df1,df2,on="city",how="inner")
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65

In [ ]:
df3=pd.merge(df1,df2,on="city",how="outer")
df3

        city  temperature  humidity
0   new york         21.0      68.0
1    chicago         14.0      65.0
2    orlando         35.0       NaN
3  baltimore         38.0       NaN
4  san diego          NaN      71.0

In [ ]:
df3=pd.merge(df1,df2,on="city",how="left")
df3

        city  temperature  humidity
0   new york           21      68.0
1    chicago           14      65.0
2    orlando           35       NaN
3  baltimore           38       NaN

In [ ]:
df3=pd.merge(df1,df2,on="city",how="right")
df3

        city  temperature  humidity
0    chicago         14.0        65
1   new york         21.0        68
2  san diego          NaN        71

In [ ]:
#indicator flag
# indicator flag that what type of joint 

df3=pd.merge(df1,df2,on="city",how="outer",indicator=True)
df3

        city  temperature  humidity      _merge
0   new york         21.0      68.0        both
1    chicago         14.0      65.0        both
2    orlando         35.0       NaN   left_only
3  baltimore         38.0       NaN   left_only
4  san diego          NaN      71.0  right_only

In [ ]:
#suffixes
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando", "baltimore"],
    "temperature": [21,14,35,38],
    "humidity": [65,68,71, 75]
})
df1

        city  temperature  humidity
0   new york           21        65
1    chicago           14        68
2    orlando           35        71
3  baltimore           38        75

In [ ]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","san diego"],
    "temperature": [21,14,35],
    "humidity": [65,68,71]
})
df2

        city  temperature  humidity
0    chicago           21        65
1   new york           14        68
2  san diego           35        71

In [ ]:
df3= pd.merge(df1,df2,on="city",how="outer", suffixes=('_first','_second'))
df3

        city  temperature_first  ...  temperature_second  humidity_second
0   new york               21.0  ...                14.0             68.0
1    chicago               14.0  ...                21.0             65.0
2    orlando               35.0  ...                 NaN              NaN
3  baltimore               38.0  ...                 NaN              NaN
4  san diego                NaN  ...                35.0             71.0

[5 rows x 5 columns]

In [ ]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
})
df1.set_index('city',inplace=True)
df1

          temperature
city
new york           21
chicago            14
orlando            35

In [ ]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","orlando"],
    "humidity": [65,68,75],
})
df2.set_index('city',inplace=True)
df2

          humidity
city
chicago         65
new york        68
orlando         75

In [ ]:
df1.join(df2,lsuffix='_l', rsuffix='_r')

          temperature  humidity
city
new york           21        68
chicago            14        65
orlando            35        75

# **Pandas-Concatination**
**pandas.concat(objs, axis=0, join='outer', ignore_index=False, keys=None, levels=None, names=None, verify_integrity=False, sort=False, copy=True)[source]**

* **objs**--> a sequence or mapping of Series or DataFrame objects
If a mapping is passed, the sorted keys will be used as the keys argument, unless it is passed, in which case the values will be selected (see below). Any None objects will be dropped silently unless they are all None in which case a ValueError will be raised.
* **axis--> {0/’index’, 1/’columns’}, default 0**
The axis to concatenate along.
* **join--> {‘inner’, ‘outer’}, default ‘outer’**
How to handle indexes on other axis (or axes).
* **ignore_index--> bool, default False**
If True, do not use the index values along the concatenation axis. The resulting axis will be labeled 0, …, n - 1. This is useful if you are concatenating objects where the concatenation axis does not have meaningful indexing information. Note the index values on the other axes are still respected in the join.
* **keys--> sequence, default None**
If multiple levels passed, should contain tuples. Construct hierarchical index using the passed keys as the outermost level.
* **levels--> list of sequences, default None**
Specific levels (unique values) to use for constructing a MultiIndex. Otherwise they will be inferred from the keys.
* **names--> list, default None**
Names for the levels in the resulting hierarchical index.
* **verify_integrity--> bool, default False**
Check whether the new concatenated axis contains duplicates. This can be very expensive relative to the actual data concatenation.
* **sort--> bool, default False**
Sort non-concatenation axis if it is not already aligned when join is ‘outer’. This has no effect when join='inner', which already preserves the order of the non-concatenation axis.
* **copy--> bool, default True**
If False, do not copy data unnecessarily.

In [ ]:
import pandas as pd
# Create a DataFrame NO-1 (india_weather)
india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [ ]:
# Create a DataFrame NO-2 (us_weather)

us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [ ]:
# Concat column wise

df = pd.concat([india_weather, us_weather])
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [ ]:
#Ignore Index
df = pd.concat([india_weather, us_weather], ignore_index=True)
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [ ]:
#Concatenation And Keys
df = pd.concat([india_weather, us_weather], keys=["india", "us"])
df

             city  temperature  humidity
india 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
us    0  new york           21        68
      1   chicago           14        65
      2   orlando           35        75

In [ ]:
df.loc["us"]

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [ ]:
df.loc["india"]

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [ ]:
#Concatenation Using Index
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
}, index=[0,1,2])
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [ ]:
windspeed_df = pd.DataFrame({
    "city": ["delhi","mumbai"],
    "windspeed": [7,12],
}, index=[1,0])
windspeed_df

     city  windspeed
1   delhi          7
0  mumbai         12

In [ ]:
# Concat row wise
df = pd.concat([temperature_df,windspeed_df],axis=1)
df

       city  temperature    city  windspeed
0    mumbai           32  mumbai       12.0
1     delhi           45   delhi        7.0
2  banglore           30     NaN        NaN

In [ ]:
#Concatenate dataframe with series
s = pd.Series(["Humid","Dry","Rain"], name="event")
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [ ]:
df = pd.concat([temperature_df,s],axis=1)
df

       city  temperature  event
0    mumbai           32  Humid
1     delhi           45    Dry
2  banglore           30   Rain

### Join
**DataFrame.join(other, on=None, how='left', lsuffix='', rsuffix='', sort=False)**

* **other--> DataFrame, Series, or list of DataFrame**
Index should be similar to one of the columns in this one. If a Series is passed, its name attribute must be set, and that will be used as the column name in the resulting joined DataFrame.
* **on--> str, list of str, or array-like, optional**
Column or index level name(s) in the caller to join on the index in other, otherwise joins index-on-index. If multiple values given, the other DataFrame must have a MultiIndex. Can pass an array as the join key if it is not already contained in the calling DataFrame. Like an Excel VLOOKUP operation.
* **how--> {‘left’, ‘right’, ‘outer’, ‘inner’}, default ‘left’**
How to handle the operation of the two objects.
** **left:** use calling frame’s index (or column if on is specified)
** **right:** use other’s index.
** **outer:** form union of calling frame’s index (or column if on is specified) with other’s index, and sort it. lexicographically.
** **inner:** form intersection of calling frame’s index (or column if on is specified) with other’s index, preserving the order of the calling’s one.
* **lsuffix--> str, default ‘’**
Suffix to use from left frame’s overlapping columns.
* **rsuffix--> str, default ‘’**
Suffix to use from right frame’s overlapping columns.
* **sort--> bool, default False**
Order result DataFrame lexicographically by the join key. If False, the order of the join key depends on the join type (how keyword).

In [ ]:
df = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3', 'K4', 'K5'],
                   'A': ['A0', 'A1', 'A2', 'A3', 'A4', 'A5']})
df

  key   A
0  K0  A0
1  K1  A1
2  K2  A2
3  K3  A3
4  K4  A4
5  K5  A5

In [ ]:
df2 = pd.DataFrame({'key': ['K0', 'K1', 'K2'],
                      'B': ['B0', 'B1', 'B2']})
df2

  key   B
0  K0  B0
1  K1  B1
2  K2  B2

In [ ]:
df.join(df2, lsuffix='_caller', rsuffix='_other')

  key_caller   A key_other    B
0         K0  A0        K0   B0
1         K1  A1        K1   B1
2         K2  A2        K2   B2
3         K3  A3       NaN  NaN
4         K4  A4       NaN  NaN
5         K5  A5       NaN  NaN

### **Append**--Append rows of other to the end of caller, returning a new object.Columns in other that are not in the caller are added as new columns.
**DataFrame.append(other, ignore_index=False, verify_integrity=False, sort=False)**
* **other--> DataFrame or Series/dict-like object, or list of these**
The data to append.
* **ignore_index--> bool, default False**
If True, the resulting axis will be labeled 0, 1, …, n - 1.
* **verify_integrity--> bool, default False**
If True, raise ValueError on creating index with duplicates.
* **sort--> bool, default False**
Sort columns if the columns of self and other are not aligned.

In [ ]:
df = pd.DataFrame([[1, 2], [3, 4]], columns=list('AB'))
df

   A  B
0  1  2
1  3  4

In [ ]:
df2 = pd.DataFrame([[5, 6], [7, 8]], columns=list('AB'))
df2

   A  B
0  5  6
1  7  8

In [ ]:
df.append(df2)

   A  B
0  1  2
1  3  4
0  5  6
1  7  8